<template>
  <div id="Disclaimer">
    <div>
      <h1><span>免责声明</span>
        <button @click="onCloseDialog" class="btn-notice-close"></button>
      </h1>
      <div class="wrap">
        <p>一、用户可通过本平台测试、购买数据接口，提交的资料必须真实，联系方式要确保有效。提供无效的合作资料和联系方式 ，火牛电竞数据有权取消数据提供，一切因此而造成的后果，火牛电竞数据概不负责。</p>
        <p>二、火牛电竞数据提供的资讯数据仅供体育爱好者订阅浏览，任何人不得用于非法用途。用户测试、购买数据接口要合法使 用、合法经营，必须符合《互联网信息服务管理办法》的相关国家政策法律规定。如发现用户使用数据非法经营，涉嫌违反
          国家法律规定的任何经营行为（如博彩投注），涉及上述不可抗力情况，火牛电竞数据有权随时终止相关数据接口服务，用 户需自行承担相应法律责任及损失。</p>
        <p>三、用户通过本平台测试、购买数据，即表明同意火牛电竞数据有关协定和数据交付方式，并有足够技术力量获取数据，火 牛电竞数据只对用户提出的数据接口问题给予技术支持，对于与数据接口无关的问题不作技术支持（例如页面设计、服务器
          设定等）。</p>
        <p>四、用户根据自身需求通过本平台选购数据接口，支付相应款项得到数据接口和有关技术说明后，火牛电竞数据根据用户购
          买的服务时间提供接口服务，此期间由于用户方的关系（例如经营倒闭、技术人员离职或技术力量不足等）提出中止数据的， 火牛电竞数据会提供服务至购买服务时间到期为止，不提供退款服务。</p>
        <p>五、鉴于计算机及互联网的特殊性，因进行机房软硬件配置、维护的短时间数据中断，或由于Internet上通路的阻塞造成数
          据服务器访问速度下降，或政府禁令、罢工、现行生效的适用法律或法规的变更、洪水、火灾、爆炸、雷电、地震、风暴、 停电、通讯线路中断、他人蓄意破坏、黑客攻击、计算机病毒入侵或发作、电信部门技术、政策、政府管制等及其他不可预
          见、不可避免、不可控制的不可抗力因素影响网络正常运作，因此而至使用户全部或部分数据获取出现问题，火牛电竞数据 概不负责。</p>
        <p>六、用户获得的火牛电竞数据仅限于用户进行合法的业务使用，不得用作其他用途，用户对此数据使用自行承担 法律责任。用户不得未经火牛电竞数据同意把数据接口提供给任何第三方使用（包括：将API接口以分接的方式提供给第三
          方，或任何形式 的接口分销行为）。若用户违反本条款约定、或违反法律规定，火牛电竞数据有权终止与用户的合作且火牛 电竞数据对此无需承担任何法律责任，用户承担相应法律责任。用户承诺在约定时间内支付相关款项，即表明同意火牛电竞
          数据有关协定和数据交付方式，并有足够技术力量获取数据，火牛电竞数据有权在用户未能准时付款的情况下中断数据提供。</p>
        <p>七、本声明未涉及的问题参见国家有关法律法规，当本声明与国家法律法规冲突时，以国家法律法规为准。</p>
        <p>八、凡在本平台申请测试、购买数据接口的用户，视为自愿接受本网站声明的约束，本声明修改权、更新权及最终解释权均 属火牛电竞数据所有。</p>
      </div>
    </div>
  </div>
</template>

<script>//
export default {
  name: 'Disclaimer',
  data: () => {
    return {
      dialogShow: false
    }
  },
  methods: {
    onCloseDialog () {
      this.$emit('close')
    }
  }
}
</script>
<style lang="scss" scoped>
  #Disclaimer {
    position: fixed;
    top: 0;
    /*left: 0;*/
    background-color: $bg-color;
    z-index: 3;
    width: 100%;
    height: calc(100% - 90px);
    max-width: 640px;
    margin: 90px auto 0 auto;

    div {
      padding: 20px;

      h1 {
        font-size: 15px;
        font-weight: bold;
        text-align: center;
        padding-bottom: 10px;

        .btn-notice-close {
          width: 24px;
          height: 24px;
          float: right;
        }
      }

      div.wrap {
        position: absolute;
        width: calc(100% - 40px);
        height: calc(100% - 70px);
        overflow: scroll;
        padding: 0;

        p {
          margin-bottom: 10px;
          text-align: left;
          color: #131313;
          font-size: 12px;
          line-height: 22px;
        }
      }
    }
  }
</style>
